// ЗАДАНИЕ 1
// Напишите программу на JavaScript, что будет высчитывать сумму чисел кратных 3 или 5. Числа должны быть до 1000.


// - - - - - - - - - - - - - - - ВАРИАНТ 1 - - - - - - - - - - - - - - - 
let sumfor = 0;
for (let i = 1; i < 1000; i++)
    if ((i % 3 === 0) || (i % 5 === 0))
        sumfor += i;
console.log("> ВАРИАНТ с FOR:");
console.log("Сумма чисел кратных 3 и 5 от 0 до 1000 равна: " + sumfor);


// - - - - - - - - - - - - - - - ВАРИАНТ 2 - - - - - - - - - - - - - - - 
let sumwhile = 0;
let i = 1;
while (i < 1000) {
    ((i % 3 === 0) || (i % 5 === 0))? sumwhile += i: sumwhile
    i++
}
console.log("> ВАРИАНТ с WHILE:");
console.log("Сумма чисел кратных 3 и 5 от 0 до 1000 равна: " + sumwhile);


// - - - - - - - - - - - - - - - ВАРИАНТ 3 - - - - - - - - - - - - - - - 
let sum = 0
max = prompt("Введите число, до которого будет подсчитываться сумма всех чисел кратных 3 или 5")
for (let j = 1; j < max; j++) 
    ((j % 3 === 0) || (j % 5 === 0))? sum += j: sum;
console.log("ВАРИАНТ с PROMPT:")
console.log("Сумма чисел кратных 3 и 5 от 0 до " + max + " равна: " + sum)


console.log("- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - ")